EDT_2/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT_2/src/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПоместитьФайлОбъекта(Адрес)
	Спр=РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Адрес);
	Спр.Фотография=Новый ХранилищеЗначения(ДвоичныеДанные);
	Спр.Записать();
	УдалитьИзВременногоХранилища(Адрес);
	АдресКартинки=Адрес;
	ЗначениеВРеквизитФормы(Спр,"Объект");
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Спр=РеквизитФормыВЗначение("Объект");
	Если Спр.Фотография.Получить()<>Неопределено Тогда
		АдресКартинки=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Перем Имя,Адрес;
	Если ПоместитьФайл(Адрес,"",Имя,Истина,ЭтаФорма.УникальныйИдентификатор) Тогда
		Объект.ИмяФайла=Имя;
		ПоместитьФайлОбъекта(Адрес);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Выгрузить(Команда)
	АдресКартинки=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография");
	ПолучитьФайл(АдресКартинки,Объект.ИмяФайла,Истина);
КонецПроцедуры
